#!/usr/bin/env python
# encoding: utf-8
# @author: qiaoxc
# @file: 运算符.py
# @time: 2021/11/14 18:49
# @desc: python 整除向下取值

# ------------------------1、 算数运算符 -------------------------

num2 = 10
num = -3

print(num2 // num)

# -------------------------5、 赋值运算符：解包赋值 -----------------

s1, s2 = 10, 20
print("赋值之前：", s1, s2)
s1, s2 = s2, s1
print("赋值之后：", s1, s2)

#  -------------------3、 比较运行算符 -------------------
"""
python：
    == 比较的是值
    is 比较的是id
java：
    == 比较的是地址值
    equals 比较的的值
    备注：如果是非基本类型，只能用equals比较
"""
# ------------------------- 4、 布尔运算符 --------------------
f = True
b = False
print(not f)

message = "hello world"
print('m' in message)
print('h' not in message)

# --------------------------2、 位运算符 ------------------

'''
    转成二进制比较
    & | << >>
    两个数转换成两个二进制的数 s1,s2
    备注：同列为1时，结果位为1，结果行转换得出结果
'''




