#!/usr/bin/env python
# encoding: utf-8
# @author: qiaoxc
# @file: 字符串常用方法.py
# @time: 2021/11/22 21:53
# @desc:

'''
字符串比较
Python:
    ==：比较的value值
    is：比较的id值（地址值）
Java：
    ==：基本类型比较的是值；符合数据类型比较的地址值
    equals：只针对于符合数据类型，比较的是值
'''

print("-----------------------------字符串  切片------------------------------")
s = 'hello,world'
s1 = s[:5]  # 从索引为0开始切
s2 = s[6:]  # 从索引为6开始切
s3 = s1 + s2
print(s1)
print(s2)
print(s3)
print('-----------------------------字符串切片[start:end:step]------------------------------')

print('-----------------------------字符串格式化------------------------------')
'''
方式一：%占位符
'''
name = '张三'
sex = '男'
age = 20
print("我叫：%s，性别：%s，今年：%d" % (name, sex, age))

'''
方式二：{}
'''
print('我叫{0}，今年{1}，性别{2},我弟弟几年也{1}岁'.format(name, age, sex))
'''
方式三：f-string
'''
print(f'我叫{name}，今年{age}，性别{sex},我弟弟几年也{age}岁')

print('-----------------------------字符串精度------------------------------')
print('%3d' % 99)  # 3表示宽度，包含本身
print('%.3f' % 3.142596)  # .3表示精度
# 同时表示宽度和精度
print('%10.3f' % 3.142596)

print('{0:.3}'.format(3.142596))  # 0代表占位符，可以省略不写，.3代表几位数
print('{0:10.3f}'.format(3.142596))  # 0代表占位符，宽度是10，.3f代表小数
